Hello @dawiddzhafarov,

Absolutelly appreciate taking a look at it.
I somehow completelly missed the part about executing `sh import.sh`, haven't seen it in docs, my bad.

Your suggestion partially fixed the issue, but still something isn't right about `contract_id`'s

So, I am performing those steps now:

0) create file `get_property.tf` with this content:
```
data "akamai_properties" "get-my-properties" {
  contract_id = "ctr_3-XXXXX"
  group_id    = "grp_XXXXX"
}

output "my-property-list" {
  value = data.akamai_properties.get-my-properties
}
```
1. **`akamai terraform --edgerc ~/.edgerc --section default export-property redacted_property`**
output:
```
Fetching property redacted_property [======    ] Fetching property redacted_property ... [OK]
Fetching group  [========  ] Fetching group  ... [OK]
Fetching property version  [=         ] Fetching property version  ... [OK]
Fetching property rules  [======    ] Fetching property rules  ... [OK]
Fetching product name  ... [OK]
Fetching hostnames  [========= ] Fetching hostnames  ... [OK]
Fetching activation details  [          ] Fetching activation details  ... [OK]
Saving TF configurations  ... [OK]
Terraform configuration for property 'redacted_property' was saved successfully
```

2) **`sh import.sh`**
```
Initializing the backend...

Initializing provider plugins...
- Finding akamai/akamai versions matching ">= 3.5.0"...
- Installing akamai/akamai v4.1.0...
- Installed akamai/akamai v4.1.0 (signed by a HashiCorp partner, key ID A26ECDD8F0BCBA73)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.akamai_group.group: Reading...
data.akamai_properties.get-my-properties: Reading...
data.akamai_property_rules_template.rules: Reading...
data.akamai_property_rules_template.rules: Read complete after 0s [id=***]
data.akamai_group.group: Read complete after 1s [id=grp_XXXX]
data.akamai_contract.contract: Reading...
data.akamai_contract.contract: Read complete after 0s [id=ctr_2-YYYYY]
akamai_property.redacted_property: Importing from ID "prp_***,ctr_3-XXXXX,grp_****,LATEST"...
akamai_property.redacted_property: Import prepared!
  Prepared akamai_property for import
akamai_property.redacted_property: Refreshing state... [id=prp_***]
data.akamai_properties.get-my-properties: Read complete after 2s [id=grp_***]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```


3) **`terraform plan`**
output:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # akamai_property.redacted_property will be updated in-place
  ~ resource "akamai_property" "redacted_property" {
      ~ contract_id        = "ctr_3-XXXXX" -> "ctr_2-YYYYY"
        id                 = "prp_*****"
        name               = "redacted_property"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # akamai_property_activation.redacted_property will be created
  + resource "akamai_property_activation" "redacted_property" {
      + activation_id                  = (known after apply)
      + auto_acknowledge_rule_warnings = true
      + contact                        = [
          + "****",
        ]
      + errors                         = (known after apply)
      + id                             = (known after apply)
      + network                        = "STAGING"
      + note                           = "Demo purposes"
      + property                       = (known after apply)
      + property_id                    = "prp_****"
      + status                         = (known after apply)
      + version                        = 20
      + warnings                       = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

So in short, for some reason, it tries to update contract_id of the resource, which will fail I assume.
In `import.sh` file, it uses correct Contract_id, the one that I can see in Akamai dashboard, but when I run `terraform plan` it for some reason tries to update it.
In tfstate file, that is being created after `import.sh`, I can see both contract_id's being used, but I am not recognizing `ctr_2-YYYYY`. original one - `ctr_3-XXXXX` I know.

Is there a way to check what is ctr_2-YYYYY somehow?
In tfstate I can see that contract_id for group is ctr_2-YYYYY, but contract_id for property is `ctr_3-XXXXX`.

I tried to create `get_property.tf` with ctr_2-YYYYY, but that didn't changed much.
I am probably again missing something, let me know if that's some obvious mistake that I made.

 



